export const contact = {
  name: "小编",
  phone: "1234567",
  mobile: "13244477888",
  wechat: "wechat-string",
  email: "name@email.com",
  address: "公司地址",
  comment: "简单注释，请大家随便联系，微信最好"
}


export const experts =
  [{
    imgUrl: "/imgs/xingji.png",
    name: "邢继",
    title: "“华龙一号”总设计师",
    description: "中国核电工程有限公司副总经理、总工程师、“华龙一号”总设计师，致力于核电工程的设计研究及管理工作"
  },
  {
    imgUrl: "/imgs/yujunsong.png",
    name: "于俊崇",
    title: "中国工程科学院院士",
    description: "中国工程科学院院士，著有“核电发展势在必行，提高和安全文化素养是关键”等"
  },
  {
    imgUrl: "/imgs/wangliming.png",
    name: "王黎明",
    title: "中核集团核燃料领域首席专家",
    description: "中核集团核燃料领域首席专家，著有'创新是科技进步的动力之源'"
  },
  {
    imgUrl: "/imgs/yeqiqin.png",
    name: "叶奇蓁",
    title: "中国工程科学院院士",
    description: "中国工程科学院院士，著有“我国核电仪控系统的自主化之路”等"
  }]

export const companies = [{
    committee: "钱智民",
    title: "理事长",
    name: "中国核工业集团公司"
  },
  {
    committee: "祖斌",
    title: "副理事长",
    name: "中国核工业建设集团公司"
  },
  {
    committee: "王永福",
    title: "副理事长",
    name: "中国华能集团公司"
  },
  {
    committee: "王平",
    title: "副理事长",
    name: "中国大唐集团公司"
  },
  {
    committee: "余剑锋",
    title: "副理事长",
    name: "中国电力投资集团公司"
  },
  {
    committee: "郑建能",
    title: "副理事长",
    name: "中国第二重型机械集团公司"
  }]

export const conferences =
  [{
    name: "2016 年亚洲核工业技术管理论坛",
    date: new Date(),
    suburb: "北京海淀区",
    address: "中国北京海淀区北大街 1899 号 8 楼"
  },
  {
    name: "2017 年世界核工业技术高峰",
    date: new Date("2017-01-05"),
    suburb: "上海徐汇区",
    address: "中国上海徐汇区南京路 67 号逸夫楼 3 层"
  },
  {
    name: "2017 中美核技术交流年会",
    date: new Date("2017-09-05"),
    suburb: "San Jose, CA",
    address: "18 Mill St, San Jose, California USA"
  }]

export const notice = {
  text:
  `
  ## 中国核工业征稿

  中国核工业现面向社会全面征稿，来稿请直接通过网站在线系统投稿或发我刊邮箱。稿件题头下一行必须写清第一作者的详细地址和电话，包括手机号码；有通讯作者的请给予标注，并写明邮箱。本期刊的审稿周期为1-3周，过期尚未收到投稿的作者可另投其他期刊。

  ### 学术杂志网绿色投稿同道优势介绍：
  1. 审稿快：《中国核工业》内部审稿通道为1-3周，大大缩短了投、审、刊的时间；
  2. 发刊快：凡是在本站编辑部投稿并确定录用的稿件，可享受1-6个月见刊；
  3. 沟通好：专业老师对你的稿件编辑情况、排刊情况、见刊情况进行及时沟通；
  4. 有保障：有专业的专家教授团队，为您免费修改需要返修的《中国核工业》论文；
  5. 送期刊：凡是在本站投稿的作者，均可免费获得《中国核工业》杂志一本；
  6. 我们还可以为你提供CNKI反抄袭检测、继教学分、著书代理、英文翻译等服务。

  ### 一、《中国核工业》投稿要求
  1. 投稿格式：投稿杂志名称-投稿文章标题-作者姓名-联系电话-联系地址；
  2. 投稿文章不违反宪法和法律，不损害公共利益。
  3. 投稿文章是作者独立取得的原创性、学术研究成果，不侵犯任何著作权和版权，不损害第三方的其他权利；所有来稿必须通过我刊社的“中国知网期刊学术不端文献检测系统”检测，文字复制比必须低于用稿标准，引用部分文字的要在参考文献中注明；署名和作者单位无误。
  4. 我刊初审周期为1－7个工作日，请在投稿3天后查看您的邮箱，收阅我们的审稿回复或用稿通知；若20天内没有收到我们的回复，稿件可自行处理。
  5. 按用稿通知上的要求办理相关手续后，稿件将进入出版程序；
  6. 杂志出刊后，我们会按照您提供的地址免费奉寄样刊。
  7. 未曾以任何形式用任何文种在国内外公开发表过。

  ### 二、《中国核工业》投稿付费须知

  凡是投入本站并确定发表的稿件，杂志社出具录取通知书，其作者须支付相关费用，本网站提供相关收据证明，并签订书面合同。网站免费对稿件进行修改以确保杂志社通过，稿件录用后，网站提供杂志社刊发的相关录用通知单，作者收到通知单后支付全部款项。

  ### 三、《中国核工业》版权告知

  1. 所有向《中国核工业》投递的作品无论是否发表，作者均依照《中华人民共和国著作权法》享有著作权。
  2. 所有向《中国核工业》投稿作品及其相关合作机构，享有使用权。`
}

export const magazines = [{
  name: "中国核电"
},{
  name: "原子能科学技术"
},{
  name: "核技术"
},{
  name: "核电子学与探测技术"
},{
  name: "核化学与放射化学"
},{
  name: "核科技进展"
},{
  name: "铀矿冶"
},{
  name: "核技术"
},{
  name: "核科学与工程"
},{
  name: "核动力工程"
},{
  name: "辐射防护"
},{
  name: "强激光与粒子束"
},{
  name: "核聚变与等离子物理"
},{
  name: "同位素"
},{
  name: "核标准计量与质量"
},{
  name: "中国核工业"
}]

export const strategies = [
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'},
  {title: '如何做那万绿葱葱中的一点红!'} ]

export const skills = [
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'},
  {title: '拯救你溺水的标题!'} ]

export const latestArticles = [
  {authors: ["吴炳晨"], title: "核电厂外电源系统保护带负荷试验替补方法研究"},
  {authors: ["徐智", "鲍麒"], title: "潜在通路分析技术在AP1000核电厂主回路设计中的应用"},
  {authors: ["吴炳晨"], title: "核电厂外电源系统保护带负荷试验替补方法研究"},
  {authors: ["徐智", "鲍麒"], title: "潜在通路分析技术在AP1000核电厂主回路设计中的应用"},
  {authors: ["吴炳晨"], title: "核电厂外电源系统保护带负荷试验替补方法研究"},
  {authors: ["徐智", "鲍麒"], title: "潜在通路分析技术在AP1000核电厂主回路设计中的应用"}
]

export const markdownGuide =
`
Markdown 入门手册
==============

#### 一. 简单功能


#### 二. 其他功能
##### 1. 换行
在需要换行的地方敲击两次空格和一个回车键即可，如:

\`\`\`
这是第一行(空格)(空格)(回车)
这是第二行
\`\`\`

Tip: 多条新行都会被视为一行
##### 2. 标题
Markdown 提供了六种规格的标题，分别对应 Html 标签中的\`<h1>\`-\`<h6>\`，通过添加不同数量的\`#\`字符可以实现不同大小的标题，如:
\`\`\`
# 最大的标题(相当于一个<h1>标签)
## 次大的标题(相当于一个<h2>标签)
...
###### 最小的标题(相当于一个<h6>标签)
\`\`\`
Tip: \# 越多，标题越小
##### 3. 列表
###### 3.1 有序列表
数字 + . + 空格即可，以下代码：
\`\`\`
1. 项目1
2. 项目2
3. 项目3
\`\`\`
效果为：
1. 项目1
2. 项目2
3. 项目3

###### 3.2 无序列表
以 * 和空格开头即可，以下代码:
\`\`\`
* 项目1
* 项目2
* 项目3
\`\`\`
效果为：
* 项目1
* 项目2
* 项目3

###### 3.3 子项目表示：
子项目缩进一个 tab 并加 * 和 空格表示，以下代码：
\`\`\`
* 项目1
    * 子项目1
    * 子项目2
* 项目2
    * 子项目1
\`\`\`
效果为：
* 项目1
    * 子项目1
    * 子项目2
* 项目2
    * 子项目1

##### 4. 代码块
以 \`\`\` 和 \`\`\` 包含，以下代码：
<pre><code>
\`\`\`
def hello():
    print 'Hello World!'
\`\`\`
</code></pre>
效果为：
\`\`\`
def hello():
    print 'Hello World!'
\`\`\`

GFM 扩展了 Markdown 的代码块功能，通过在上面第一个 \`\`\` 后添加语言名称，使不同语言展现不同的代码高亮风格，以下代码:
<pre><code>
\`\`\`java
public static void main(String[] args){
    System.out.println("Hello World!");
}
\`\`\`
</code></pre>
效果为：
\`\`\`java
public static void main(String[] args){
    System.out.println("Hello World!");
}
\`\`\`

以下代码：
<pre><code>
\`\`\`python
def hello():
    print 'Hello World!'
\`\`\`
</code></pre>

效果为：
\`\`\`python
def hello():
    print 'Hello World!'
\`\`\`

##### 5. 表格
标准的 Markdown 中并不支持表格，但 GFM 可以，表头前空一行，以 \`---\`  做为表头分隔，以 \`|\` 做为列分隔，以下代码：
\`\`\`
表头1|表头2
---|---
单元格1|单元格2
单元格3|单元格4
\`\`\`
效果为：

表头1|表头2
---|---
单元格1|单元格2
单元格3|单元格4

而且还可以通过在表头分隔符中添加 \`:\` 来决定单元格的对齐方向，以下代码：
\`\`\`
表头1|表头2|表头3
:--|:--:|--:
左1|中1|右1
左2|中2|右2
\`\`\`
效果为：

表头1|表头2|表头3
:--|:--:|--:
左1|中1|右1
左2|中2|右2

##### 6. 特殊字符转义
如果需要在正文里使用特殊字符的话，可以用 \`\` 来转义
最后虽然 GFW 支持 Html 标签，不过本次项目中不允许在 MarkDown 中插入 Html 标签
`

export const apiLinks = {
  current: "http://zghd.cbpt.cnki.net/wkd/WapPublication/cuurentIssuePaper.aspx", //本期目次
  search: "http://zghd.cbpt.cnki.net/EditorDN/Mobile/PaperSearch.aspx", //稿件查询
  past: "http://zghd.cbpt.cnki.net/wkd/WapPublication/pastIssue.aspx" //过刊浏览
}
