import React from 'react';

const Notice = () => (
  <div>
    <img src="imgs/mag.png" width="100%"/>
    <h3 className="ui center aligned header">征稿启事</h3>
    <p> 需要支持在线编辑？？？</p>
      中国核工业现面向社会全面征稿，来稿请直接通过网站在线系统投稿或发我刊邮箱。稿件题头下一行必须写清第一作者的详细地址和电话，包括手机号码；有通讯作者的请给予标注，并写明邮箱。本期刊的审稿周期为1-3周，过期尚未收到投稿的作者可另投其他期刊。

    学术杂志网绿色投稿同道优势介绍：
    1、审稿快：《中国核工业》内部审稿通道为1-3周，大大缩短了投、审、刊的时间；
    2、发刊快：凡是在本站编辑部投稿并确定录用的稿件，可享受1-6个月见刊；
    3、沟通好：专业老师对你的稿件编辑情况、排刊情况、见刊情况进行及时沟通；
    4、有保障：有专业的专家教授团队，为您免费修改需要返修的《中国核工业》论文；
    5、送期刊：凡是在本站投稿的作者，均可免费获得《中国核工业》杂志一本；
     6、我们还可以为你提供CNKI反抄袭检测、继教学分、著书代理、英文翻译等服务。

    一、《中国核工业》投稿要求
    （1）投稿格式：投稿杂志名称-投稿文章标题-作者姓名-联系电话-联系地址；
    （2）投稿文章不违反宪法和法律，不损害公共利益。
    （3）投稿文章是作者独立取得的原创性、学术研究成果，不侵犯任何著作权和版权，不损害第三方的其他权利；所有来稿必须通过我刊社的“中国知网期刊学术不端文献检测系统”检测，文字复制比必须低于用稿标准，引用部分文字的要在参考文献中注明；署名和作者单位无误。
    （4）我刊初审周期为1－7个工作日，请在投稿3天后查看您的邮箱，收阅我们的审稿回复或用稿通知；若20天内没有收到我们的回复，稿件可自行处理。
    （5）按用稿通知上的要求办理相关手续后，稿件将进入出版程序；
    （6）杂志出刊后，我们会按照您提供的地址免费奉寄样刊。
    （7）未曾以任何形式用任何文种在国内外公开发表过。

     二、《中国核工业》投稿付费须知
    凡是投入本站并确定发表的稿件，杂志社出具录取通知书，其作者须支付相关费用，本网站提供相关收据证明，并签订书面合同。网站免费对稿件进行修改以确保杂志社通过，稿件录用后，网站提供杂志社刊发的相关录用通知单，作者收到通知单后支付全部款项。

     三、《中国核工业》版权告知
    1.所有向《中国核工业》投递的作品无论是否发表，作者均依照《中华人民共和国著作权法》享有著作权。
    2.所有向《中国核工业》投稿作品及其相关合作机构，享有使用权。
  </div>
);

export default Notice;
